app/controllers/quotes_controller.rb

SELECT "quotes".* FROM "quotes" ORDER BY "quotes"."id" DESC
---
  def index
    @quotes = current_company.quotes.ordered

SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def set_quote
    # We must use current_company.quotes here instead of Quote
    # for security reasons
    @quote = current_company.quotes.find(params[:id])